nickfox-taterli/stm32l4_disco_test/Drivers/Components/OnBoard/Inc/MEMS.h
/** @defgroup Mag_Reboot
  * @{
  */ 
#define LSM303C_MAG_REBOOT_DEFAULT           ((uint8_t) 0x00 << 3)
#define LSM303C_MAG_REBOOT_ENABLE            ((uint8_t) 0x01 << 3)
/**
  * @}
  */ 

/** @defgroup Mag_Soft_reset
  * @{
  */ 
#define LSM303C_MAG_SOFT_RESET_DEFAULT       ((uint8_t) 0x00 << 2)
#define LSM303C_MAG_SOFT_RESET_ENABLE        ((uint8_t) 0x01 << 2)
/**
  * @}
  */ 

/** @defgroup Mag_Communication_Mode 
  * @{
  */ 
#define LSM303C_MAG_I2C_MODE                 ((uint8_t) 0x80)
#define LSM303C_MAG_SPI_MODE                 ((uint8_t) 0x04)
/**
  * @}
  */

/** @defgroup Mag_Lowpower_mode_config 
  * @{
  */ 
#define LSM303C_MAG_CONFIG_NORMAL_MODE       ((uint8_t) 0x00)
#define LSM303C_MAG_CONFIG_LOWPOWER_MODE     ((uint8_t) 0x20)
/**
  * @}
  */   

/** @defgroup Mag_Operation_Mode 
  * @{
  */ 
#define LSM303C_MAG_SELECTION_MODE           ((uint8_t) 0x03)
#define LSM303C_MAG_CONTINUOUS_MODE          ((uint8_t) 0x00)
#define LSM303C_MAG_SINGLE_MODE              ((uint8_t) 0x01)
#define LSM303C_MAG_POWERDOWN1_MODE          ((uint8_t) 0x02)
#define LSM303C_MAG_POWERDOWN2_MODE          ((uint8_t) 0x03)
/**
  * @}
  */

/** @defgroup Mag_Z-axis_Operation_Mode 
  * @{
  */ 
#define LSM303C_MAG_OM_Z_LOWPOWER            ((uint8_t) 0x00 << 2)
#define LSM303C_MAG_OM_Z_MEDIUM              ((uint8_t) 0x01 << 2)
#define LSM303C_MAG_OM_Z_HIGH                ((uint8_t) 0x02 << 2)
#define LSM303C_MAG_OM_Z_ULTRAHIGH           ((uint8_t) 0x03 << 2)   
/**
  * @}
  */   

/** @defgroup Mag_Big_little-endian_selection 
  * @{
  */ 
#define LSM303C_MAG_BLE_LSB                  ((uint8_t) 0x00)
#define LSM303C_MAG_BLE_MSB                  ((uint8_t) 0x02)
/**
  * @}
  */   

/** @defgroup Mag_Bloc_update_magnetic_data 
  * @{
  */ 
#define LSM303C_MAG_BDU_CONTINUOUS           ((uint8_t) 0x00)
#define LSM303C_MAG_BDU_MSBLSB              ((uint8_t) 0x40)
/**
  * @}
  */      

/**
 * @defgroup Magnetometer_Sensitivity
 * @{
 */
#define LSM303C_M_SENSITIVITY_XY_1_3Ga     1100  /*!< magnetometer X Y axes sensitivity for 1.3 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_XY_1_9Ga     855   /*!< magnetometer X Y axes sensitivity for 1.9 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_XY_2_5Ga     670   /*!< magnetometer X Y axes sensitivity for 2.5 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_XY_4Ga       450   /*!< magnetometer X Y axes sensitivity for 4 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_XY_4_7Ga     400   /*!< magnetometer X Y axes sensitivity for 4.7 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_XY_5_6Ga     330   /*!< magnetometer X Y axes sensitivity for 5.6 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_XY_8_1Ga     230   /*!< magnetometer X Y axes sensitivity for 8.1 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_Z_1_3Ga      980   /*!< magnetometer Z axis sensitivity for 1.3 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_Z_1_9Ga      760   /*!< magnetometer Z axis sensitivity for 1.9 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_Z_2_5Ga      600   /*!< magnetometer Z axis sensitivity for 2.5 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_Z_4Ga        400   /*!< magnetometer Z axis sensitivity for 4 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_Z_4_7Ga      355   /*!< magnetometer Z axis sensitivity for 4.7 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_Z_5_6Ga      295   /*!< magnetometer Z axis sensitivity for 5.6 Ga full scale [LSB/Ga] */
#define LSM303C_M_SENSITIVITY_Z_8_1Ga      205   /*!< magnetometer Z axis sensitivity for 8.1 Ga full scale [LSB/Ga] */
/**
 * @}
 */

/** @defgroup Mag_Working_Mode
  * @{
  */ 
#define LSM303C_CONTINUOUS_CONVERSION     ((uint8_t) 0x00)   /*!< Continuous-Conversion Mode */
#define LSM303C_SINGLE_CONVERSION         ((uint8_t) 0x01)   /*!< Single-Conversion Mode */
#define LSM303C_SLEEP                     ((uint8_t) 0x02)   /*!< Sleep Mode */                       
/**
  * @}
  */


void L3GD20_Init(uint16_t InitStruct);
uint8_t L3GD20_ReadID(void);
uint8_t LSM303C_AccReadID(void);

#endif
